QGDsolver/tutorials/scalarTransportQHDFoam/2D/pitzDaily/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch pitzDaily.foam
runApplication blockMesh
runApplication $(getApplication)
